app/controllers/api/businesses_controller.rb

SELECT "businesses".* FROM "businesses"
---
    def index
        @businesses = Business.all

SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @business = Business.find(params[:id])